Revit 2024 API
BuiltInFailures.DimensionFailures.SpotSlopeReferencePointIsSingular Property
 The highlighted Spot Slope references an element point that is singular.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SpotSlopeReferencePointIsSingular { get; }
Visual Basic
Public Shared ReadOnly Property SpotSlopeReferencePointIsSingular As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SpotSlopeReferencePointIsSingular {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace